app/controllers/widgets_controller.rb

SELECT * FROM "widgets"
---
  def index
    @widgets = Widget.all

SELECT * FROM "widgets" WHERE ("widgets"."id" = 1)
---
  def show
    @widget = Widget.find(params[:id])

INSERT INTO "widgets" ("created_at", "code", "updated_at", "url") VALUES('2010-10-05 03:16:57', '', '2010-10-05 03:16:57', 'http://tv.unsw.edu.au/331FB280-7E6B-11DF-9E250050568336DC')
---
  def create
    @widget = Widget.new(params[:widget])

    respond_to do |format|
      if @widget.save